In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

In [2]:
test_data=pd.read_csv('test_clean.csv')
test_data.sample(5)

,Age,Cabin,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Ticket,Title,Family_Size
72,29.0,NaN,S,7.9250,"Nieminen, Miss. Manta Josefina",0,964,3,female,0,NaN,3101297,Miss,0
259,21.0,NaN,S,7.7750,"Midtsjo, Mr. Karl Albert",0,1151,3,male,0,NaN,345501,Mr,0
166,48.0,B10,C,50.4958,"Brandeis, Mr. Emil",0,1058,1,male,0,NaN,PC 17591,Mr,0
323,33.0,NaN,S,26.5500,"Rowe, Mr. Alfred G",0,1215,1,male,0,NaN,113790,Mr,0
68,31.0,C53,C,28.5375,"Tucker, Mr. Gilbert Milligan Jr",0,960,1,male,0,NaN,2543,Mr,0

In [3]:
test_data.isnull().any()

Age            False
Cabin           True
Embarked       False
Fare           False
Name           False
Parch          False
PassengerId    False
Pclass         False
Sex            False
SibSp          False
Survived        True
Ticket         False
Title          False
Family_Size    False
dtype: bool

In [5]:
test_data['Cabin'].isnull().sum()

327

In [6]:
test_data['Survived'].isnull().sum()

418

In [7]:
test_data.drop('Cabin',axis=1,inplace=True)

In [8]:
test_data.drop('Survived',axis=1,inplace=True)

In [9]:
test_data.head()

,Age,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Ticket,Title,Family_Size
0,34.5,Q,7.8292,"Kelly, Mr. James",0,892,3,male,0,330911,Mr,0
1,47.0,S,7.0000,"Wilkes, Mrs. James (Ellen Needs)",0,893,3,female,1,363272,Mrs,1
2,62.0,Q,9.6875,"Myles, Mr. Thomas Francis",0,894,2,male,0,240276,Mr,0
3,27.0,S,8.6625,"Wirz, Mr. Albert",0,895,3,male,0,315154,Mr,0
4,22.0,S,12.2875,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",1,896,3,female,1,3101298,Mrs,2